Reports/СреднееВремяРемонта.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<Report>		<InternalInfo>			<xr:GeneratedType name="ReportObject.—реднее¬рем€–емонта" category="Object">				<xr:TypeId>16f53c91-b938-4d5d-b422-b619a3b2175b</xr:TypeId>				<xr:ValueId>3cd8694b-b0fa-4c61-8de3-639ef62fa40e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="ReportManager.—реднее¬рем€–емонта" category="Manager">				<xr:TypeId>38a311d5-3f82-4d8a-89a8-0295865011a0</xr:TypeId>				<xr:ValueId>77608ecf-6344-4d1f-8f07-147e6d8a4ff4</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>—реднее¬рем€–емонта</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>—реднее врем€ ремонта</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultForm/>			<AuxiliaryForm/>			<MainDataCompositionSchema>Report.—реднее¬рем€–емонта.Template.ќсновна€—хема омпоновкиƒанных</MainDataCompositionSchema>			<DefaultSettingsForm/>			<AuxiliarySettingsForm/>			<DefaultVariantForm/>			<VariantsStorage/>			<SettingsStorage/>			<IncludeHelpInContents>false</IncludeHelpInContents>			<ExtendedPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Template>ќсновна€—хема омпоновкиƒанных</Template>		</ChildObjects>	</Report></MetaDataObject>

AccumulationRegisters/ДвижениеЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<AccumulationRegister>		<InternalInfo>			<xr:GeneratedType name="AccumulationRegisterRecord.ДвижениеЗаказов" category="Record">				<xr:TypeId>d1665612-adc1-40aa-b545-9673135866f1</xr:TypeId>				<xr:ValueId>d8dfba19-7e5b-4bda-a936-8dca81ad23b8</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterManager.ДвижениеЗаказов" category="Manager">				<xr:TypeId>94596b33-5598-474d-ba5e-53a7d9ca4b74</xr:TypeId>				<xr:ValueId>35086a32-40b1-4dce-9bb7-af7eb4c92f63</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterSelection.ДвижениеЗаказов" category="Selection">				<xr:TypeId>37ab27af-4123-4529-a579-3ef9a0f94e69</xr:TypeId>				<xr:ValueId>fc2cc772-374f-4364-8dd9-d0a5904d39e0</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterList.ДвижениеЗаказов" category="List">				<xr:TypeId>b3dfb9d3-819e-4517-bde1-2a562b880abc</xr:TypeId>				<xr:ValueId>aac5f81f-ee21-4114-88b6-4498dc4540bf</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterRecordSet.ДвижениеЗаказов" category="RecordSet">				<xr:TypeId>dc2e40a8-0428-415e-8b42-307a35f8e67c</xr:TypeId>				<xr:ValueId>9aeed50a-837f-4ce8-b5c9-9eeb7aae5b59</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterRecordKey.ДвижениеЗаказов" category="RecordKey">				<xr:TypeId>183b3142-ea8f-45bc-933d-a80d296643d9</xr:TypeId>				<xr:ValueId>fb611d2e-b925-4d9a-ba12-8e20f6f22628</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ДвижениеЗаказов</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Движение заказов</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultListForm>AccumulationRegister.ДвижениеЗаказов.Form.ФормаСписка</DefaultListForm>			<AuxiliaryListForm/>			<RegisterType>Balance</RegisterType>			<IncludeHelpInContents>false</IncludeHelpInContents>			<StandardAttributes>				<xr:StandardAttribute name="RecordType">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSplitting>false</EnableTotalsSplitting>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Количество</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Количество</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:decimal</v8:Type>						<v8:NumberQualifiers>							<v8:Digits>10</v8:Digits>							<v8:FractionDigits>0</v8:FractionDigits>							<v8:AllowedSign>Nonnegative</v8:AllowedSign>						</v8:NumberQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Resource>			<Attribute>				<Properties>					<Name>ПредшествующаяТочкаРегистрации</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Предшествующая точка регистрации</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.ТочкиРегистрации</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Attribute>			<Attribute>				<Properties>					<Name>Смена</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Смена</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Shift</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Смены</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Attribute>			<Attribute>				<Properties>					<Name>ДатаСмены</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Дата смены</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Date of shift</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:dateTime</v8:Type>						<v8:DateQualifiers>							<v8:DateFractions>Date</v8:DateFractions>						</v8:DateQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Attribute>			<Dimension>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>Index</Indexing>					<FullTextSearch>Use</FullTextSearch>					<UseInTotals>true</UseInTotals>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>ТочкаРегистрации</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Точка регистрации</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.ТочкиРегистрации</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>Index</Indexing>					<FullTextSearch>Use</FullTextSearch>					<UseInTotals>true</UseInTotals>				</Properties>			</Dimension>			<Form>ФормаСписка</Form>			<Command>				<Properties>					<Name>ДвижениеЗаказов</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Движение заказов</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Group>FormNavigationPanelSeeAlso</Group>					<CommandParameterType>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</CommandParameterType>					<ParameterUseMode>Single</ParameterUseMode>					<ModifiesData>false</ModifiesData>					<Representation>Auto</Representation>					<ToolTip/>					<Picture/>					<Shortcut/>					<OnMainServerUnavalableBehavior>Auto</OnMainServerUnavalableBehavior>				</Properties>			</Command>		</ChildObjects>	</AccumulationRegister></MetaDataObject>

Reports/СреднееВремяРемонта/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СмещениеНачалаСмены = (6 * 60 * 60) + (45 * 60);
	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	Период = ПараметрПериод.Значение.Дата;
		
	ПараметрТочкиРегистрацииМЕС = Настройки.ПараметрыДанных.Элементы.Найти("ТочкиРегистрацииМЕС");
	ТочкиРегистрацииМЕС = ПараметрТочкиРегистрацииМЕС.Значение;
	
	Модель = Null;
	ПараметрМодель = Настройки.ПараметрыДанных.Элементы.Найти("Модель");
	Если ПараметрМодель.Использование Тогда
		Модель = ПараметрМодель.Значение;
	КонецЕсли;
	
	Бренд = Null;
	ПараметрБренд = Настройки.ПараметрыДанных.Элементы.Найти("Бренд");
	Если ПараметрБренд.Использование Тогда
		Бренд = ПараметрБренд.Значение;
	КонецЕсли;
	
	Цвет = Null;
	ПараметрЦвет = Настройки.ПараметрыДанных.Элементы.Найти("Цвет");
	Если ПараметрЦвет.Использование Тогда
		Цвет = ПараметрЦвет.Значение;
	КонецЕсли;
	
	ТочкаПроверкиКачества = Null;
	ПараметрТочкаПроверкиКачества = Настройки.ПараметрыДанных.Элементы.Найти("ТочкаПроверкиКачества");
	Если ПараметрТочкаПроверкиКачества.Использование Тогда
		ТочкаПроверкиКачества = ПараметрТочкаПроверкиКачества.Значение;
	КонецЕсли;
	
	ТЗ_Периоды = Новый ТаблицаЗначений;
	ТЗ_Периоды.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ТЗ_Периоды.Колонки.Добавить("ТипПериода", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_Периоды.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_Периоды.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТЗ_Периоды.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	
	Для ы = 0 По 1 Цикл
		НоваяСтрока = ТЗ_Периоды.Добавить();
		НоваяСтрока.Порядок = 1 - ы;
		НоваяСтрока.ТипПериода = "Y";
		НоваяСтрока.Наименование = Строка(Год(Период) - ы);
		НоваяСтрока.ДатаНачала = НачалоГода(ДобавитьМесяц(Период, -(ы * 12)));
		НоваяСтрока.ДатаОкончания = КонецГода(ДобавитьМесяц(Период, -(ы * 12)));
	КонецЦикла;
	
	Для ы = 0 По 11 Цикл
		НоваяСтрока = ТЗ_Периоды.Добавить();
		НоваяСтрока.Порядок = ы + 2;
		НоваяСтрока.ТипПериода = "M";
		НоваяСтрока.Наименование = Формат(НачалоМесяца(ДобавитьМесяц(НачалоГода(Период), ы)), "ДФ='MMM гг'");
		НоваяСтрока.ДатаНачала = НачалоМесяца(ДобавитьМесяц(НачалоГода(Период), ы));
		НоваяСтрока.ДатаОкончания = КонецМесяца(ДобавитьМесяц(НачалоГода(Период), ы));
	КонецЦикла;
	
	ПерваяНеделяМесяца = НеделяГода(НачалоМесяца(Период));
	Для ы = 0 По 5 Цикл
		Если НачалоНедели(НачалоМесяца(Период) + ы * 7 * 24 * 60 * 60) > Период Тогда
			Прервать;
		КонецЕсли;
		НоваяСтрока = ТЗ_Периоды.Добавить();
		НоваяСтрока.Порядок = ы + 14;
		НоваяСтрока.ТипПериода = "W";
		НоваяСтрока.Наименование = Строка(ПерваяНеделяМесяца + ы);
		НоваяСтрока.ДатаНачала = НачалоНедели(НачалоМесяца(Период) + ы * 7 * 24 * 60 * 60);
		НоваяСтрока.ДатаОкончания = КонецНедели(НачалоМесяца(Период) + ы * 7 *24 * 60 * 60);
	КонецЦикла;
	
	Для ы = 0 По 6 Цикл
		НоваяСтрока = ТЗ_Периоды.Добавить();
		НоваяСтрока.Порядок = ы + 20;
		НоваяСтрока.ТипПериода = "D";
		НоваяСтрока.Наименование = Формат(НачалоДня(НачалоНедели(Период) + ы * 24 * 60 * 60), "ДФ=dd.MM.yy");
		НоваяСтрока.ДатаНачала = НачалоДня(НачалоНедели(Период) + ы * 24 * 60 * 60) + СмещениеНачалаСмены;
		НоваяСтрока.ДатаОкончания = КонецДня(НачалоНедели(Период) + ы * 24 * 60 * 60) + СмещениеНачалаСмены;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Периоды.Порядок КАК Порядок,
		|	Периоды.ТипПериода КАК ТипПериода,
		|	Периоды.Наименование КАК Наименование,
		|	Периоды.ДатаНачала КАК ДатаНачала,
		|	Периоды.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_Периоды
		|ИЗ
		|	&ТЗ_Периоды КАК Периоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвижениеЗаказовОбороты.Период КАК Период,
		|	ДвижениеЗаказовОбороты.Заказ КАК Заказ,
		|	ДвижениеЗаказовОбороты.КоличествоПриход КАК КоличествоПриход
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	РегистрНакопления.ДвижениеЗаказов.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			ТочкаРегистрации В (&ТочкиРегистрацииМЕС)
		|				И ВЫБОР
		|					КОГДА &Модель ЕСТЬ NULL
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Заказ.Модель В (&Модель)
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &Бренд ЕСТЬ NULL
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Заказ.Бренд В (&Бренд)
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &Цвет ЕСТЬ NULL
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Заказ.Цвет В (&Цвет)
		|				КОНЕЦ) КАК ДвижениеЗаказовОбороты
		|ГДЕ
		|	ДвижениеЗаказовОбороты.КоличествоПриход > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Периоды.Порядок КАК Порядок,
		|	ВТ_Периоды.ТипПериода КАК ТипПериода,
		|	ВТ_Периоды.Наименование КАК Наименование,
		|	ВТ_Заказы.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВТ_ЗаказыПоПериодам
		|ИЗ
		|	ВТ_Периоды КАК ВТ_Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		|		ПО (ВТ_Заказы.Период МЕЖДУ ВТ_Периоды.ДатаНачала И ВТ_Периоды.ДатаОкончания)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Периоды.Порядок,
		|	ВТ_Периоды.ТипПериода,
		|	ВТ_Периоды.Наименование,
		|	ВТ_Заказы.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыПоПериодам.Порядок КАК Порядок,
		|	ВТ_ЗаказыПоПериодам.ТипПериода КАК ТипПериода,
		|	ВТ_ЗаказыПоПериодам.Наименование КАК Наименование,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗаказыПоПериодам.Заказ) КАК КоличествоАвто,
		|	СУММА(ЕСТЬNULL(КонсерныОбороты.Регистратор.ВремяРемонта, 0)) КАК ВремяРемонта
		|ПОМЕСТИТЬ ВТ_ВремяИКоличество
		|ИЗ
		|	ВТ_ЗаказыПоПериодам КАК ВТ_ЗаказыПоПериодам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Консерны.Обороты(
		|				,
		|				,
		|				Регистратор,
		|				ВЫБОР
		|					КОГДА &ТочкаПроверкиКачества ЕСТЬ NULL
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Консерн.ТочкаПроверкиКачества В (&ТочкаПроверкиКачества)
		|				КОНЕЦ) КАК КонсерныОбороты
		|		ПО ВТ_ЗаказыПоПериодам.Заказ = КонсерныОбороты.Заказ
		|			И (КонсерныОбороты.КоличествоРасход > 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыПоПериодам.Порядок,
		|	ВТ_ЗаказыПоПериодам.ТипПериода,
		|	ВТ_ЗаказыПоПериодам.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВремяИКоличество.Порядок КАК Порядок,
		|	ВТ_ВремяИКоличество.ТипПериода КАК ТипПериода,
		|	ВТ_ВремяИКоличество.Наименование КАК НаименованиеПериода,
		|	ВТ_ВремяИКоличество.ВремяРемонта КАК ВремяРемонта,
		|	ВТ_ВремяИКоличество.КоличествоАвто КАК КоличествоАвто,
		|	ВЫБОР
		|		КОГДА ВТ_ВремяИКоличество.КоличествоАвто = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ВремяИКоличество.ВремяРемонта / ВТ_ВремяИКоличество.КоличествоАвто
		|	КОНЕЦ КАК СреднееВремя
		|ИЗ
		|	ВТ_ВремяИКоличество КАК ВТ_ВремяИКоличество";
	
	Запрос.УстановитьПараметр("ТЗ_Периоды", ТЗ_Периоды);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ДобавитьМесяц(Период, -12)));
	Запрос.УстановитьПараметр("КонецПериода", КонецГода(Период));
	Запрос.УстановитьПараметр("ТочкиРегистрацииМЕС", ТочкиРегистрацииМЕС);
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("Бренд", Бренд);
	Запрос.УстановитьПараметр("Цвет", Цвет);
	Запрос.УстановитьПараметр("ТочкаПроверкиКачества", ТочкаПроверкиКачества);
	
	ТЗ_Источник = Запрос.Выполнить().Выгрузить();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТЗ_Ремонты", ТЗ_Источник);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти
